{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "batch_input_shape": [null, 3, 32, 32], "strides": [1, 1], "use_bias": true, "name": "conv2d_1", "activity_regularizer": null, "data_format": "channels_first", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 2], "strides": [3, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "use_bias": true, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "pool_size": [3, 2], "strides": [3, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "use_bias": true, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "pool_size": [3, 2], "strides": [3, 2], "data_format": "channels_first"}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "padding": "same", "use_bias": true, "activation": "relu", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "data_format": "channels_first", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_constraint": null, "filters": 32, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "noise_shape": null, "seed": null, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.019999999552965164}}, "use_bias": true, "trainable": true, "activation": "relu", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 1024, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "noise_shape": null, "seed": null, "rate": 0.3}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "use_bias": true, "trainable": true, "activation": "softmax", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 10, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "keras_version": "2.1.2"}
