{"keras_version": "2.1.2", "backend": "tensorflow", "config": [{"config": {"padding": "same", "name": "conv2d_1", "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 3, 32, 32], "activity_regularizer": null, "use_bias": true, "filters": 32, "activation": "relu", "trainable": true, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_1", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 32, "activation": "relu", "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "activation": "relu", "name": "conv2d_3", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_2", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 64, "activation": "relu", "name": "conv2d_4", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"padding": "same", "strides": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "filters": 128, "activation": "relu", "name": "conv2d_5", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_first", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_3", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 1024, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "relu", "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_4", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 512, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.009999999776482582}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "relu", "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"seed": null, "rate": 0.2, "name": "dropout_5", "noise_shape": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"units": 10, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "activation": "softmax", "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}
