{"keras_version": "2.1.2", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 3, 32, 32], "activation": "relu", "name": "conv2d_1", "data_format": "channels_first", "dtype": "float32", "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "trainable": true, "activity_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 2], "name": "max_pooling2d_1", "data_format": "channels_first", "strides": [3, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activation": "relu", "name": "conv2d_2", "data_format": "channels_first", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.2, "noise_shape": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [3, 2], "name": "max_pooling2d_2", "data_format": "channels_first", "strides": [3, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 1024, "activation": "relu", "name": "dense_1", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_3", "rate": 0.3, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 1024, "activation": "relu", "name": "dense_2", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}}}, {"class_name": "Dropout", "config": {"trainable": true, "seed": null, "name": "dropout_4", "rate": 0.3, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 10, "activation": "softmax", "name": "dense_3", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "activity_regularizer": null, "use_bias": true, "bias_regularizer": null, "trainable": true, "kernel_regularizer": null}}]}
