{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "filters": 64, "name": "conv2d_1", "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "padding": "same", "batch_input_shape": [null, 3, 32, 32], "kernel_size": [4, 4], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "rate": 0.3, "seed": null, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [3, 2], "data_format": "channels_first", "strides": [3, 2], "trainable": true, "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"axis": 0, "max_value": 3}}, "name": "dense_1", "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "rate": 0.3, "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "name": "dense_2", "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null}}], "keras_version": "2.1.2", "backend": "tensorflow"}
