{"keras_version": "2.1.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 64, "data_format": "channels_first", "kernel_size": [4, 4], "trainable": true, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "dtype": "float32", "batch_input_shape": [null, 3, 32, 32], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "activity_regularizer": null, "padding": "same", "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.3, "seed": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_first", "trainable": true, "padding": "valid", "pool_size": [3, 2], "name": "max_pooling2d_1", "strides": [3, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "units": 256, "bias_constraint": null, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "use_bias": true, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.3, "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_regularizer": null, "units": 10, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2"}}]}
